//export const ipAddress = '192.168.31.22:8080';
export const ipAddress = '140.143.143.190:8080';
export const protocolMode = 'https';

export const text1 = `      记得七八岁的时候，我写了第一首诗。母亲一念完那首诗，眼睛亮亮，兴奋地嚷着：“巴迪，这是你写的吗？多美的诗啊！精彩极了！”她搂着我，不住地赞扬。我既腼腆又得意洋洋，点头告诉她诗确实是我写的。她高兴得再次拥抱了我。
      整个下午我都怀着一种自豪感等待父亲回来。我用漂亮的花体字把诗认认真真誊了一遍，还用彩色笔在它的周围上画了一圈花边。将近七点钟的时候，我悄悄走进饭厅，满怀信心地把它平平整整地放在餐桌父亲的位置上。`;

export const text2 = `      “我自己会判断的。”父亲开始读诗。
      我把头埋得低低的。诗只有十行，可我觉得他读了很长的时间。“我看这首诗糟糕透了。”父亲把诗放回原处。
      我的眼睛湿润了，头也沉重得抬不起来。
      “亲爱的，我真不懂你这是什么意思！”母亲嚷道，“这不是在你的公司里。巴迪还是个孩子，这是他写的第一首诗。他需要鼓励。”
      “我不明白，”父亲并不退让，“难道世界上糟糕的诗还不够多么？哪条法律规定巴迪一定要成为诗人？”
      我再也受不了了。我冲出饭厅，跑进自己的房间，扑到床上痛哭起来。饭厅里，父母还在为那首诗争吵着。`;

export const interview = [
    '你如何评价自己？',
    '描述一下让自己印象深刻的一件事。',
    '请描述最近一次你不开心的经历，你的感受如何？',
    '什么时候你觉得自己很失败，或者让家人失望了？',
    '请描述一件你最喜欢从事的活动，可能是唱歌、画画、看电影等等，你的感觉如何？',
    '自己的优点？简要描述一下。'
]
